Repository: m-ahsan-bilal/wordify
Catalog: lib/l10n/app_*.arb
Languages: ar, hi

# appTitle
source: Word Master
ar: سيد الكلمات
hi: वर्ड मास्टर

source: Home
ar: الرئيسية
hi: होम

source: Add Word
ar: إضافة كلمة
hi: शब्द जोड़ें

source: Word List
ar: قائمة الكلمات
hi: शब्द सूची

source: Quiz
ar: اختبار
hi: क्विज़

source: Settings
ar: الإعدادات
hi: सेटिंग्स

source: About
ar: حول
hi: के बारे में

source: Backup & Restore
ar: النسخ الاحتياطي والاستعادة
hi: बैकअप और पुनर्स्थापना

source: Theme
ar: المظهر
hi: थीम

source: Language
ar: اللغة
hi: भाषा

source: Dark Mode
ar: الوضع الداكن
hi: डार्क मोड

source: Light Mode
ar: الوضع الفاتح
hi: लाइट मोड

source: English
ar: الإنجليزية
hi: अंग्रेजी

source: Urdu
ar: الأردية
hi: उर्दू

source: Hindi
ar: الهندية
hi: हिंदी

source: Arabic
ar: العربية
hi: अरबी

source: Streak
ar: السلسلة
hi: स्ट्रीक

source: XP
ar: النقاط
hi: अनुभव

# todayWords
source: Today's Words
ar: كلمات اليوم
hi: आज के शब्द

source: Word
ar: كلمة
hi: शब्द

source: Meaning
ar: المعنى
hi: अर्थ

source: Synonym
ar: مرادف
hi: पर्यायवाची

source: Antonym
ar: ضد
hi: विलोम

source: Example
ar: مثال
hi: उदाहरण

source: Save
ar: حفظ
hi: सहेजें

source: Cancel
ar: إلغاء
hi: रद्द करें

source: Delete
ar: حذف
hi: हटाएं

source: Edit
ar: تعديل
hi: संपादित करें

source: Search
ar: بحث
hi: खोजें

source: No words found
ar: لم يتم العثور على كلمات
hi: कोई शब्द नहीं मिले

source: Add your first word
ar: أضف كلمتك الأولى
hi: अपना पहला शब्द जोड़ें

# swipeUpForMeaning
source: Swipe up for meaning quiz
ar: اسحب لأعلى لاختبار المعنى
hi: अर्थ क्विज़ के लिए ऊपर स्वाइप करें

# swipeLeftForSynonym
source: Swipe left for synonym quiz
ar: اسحب لليسار لاختبار المرادف
hi: पर्यायवाची क्विज़ के लिए बाएं स्वाइप करें

# swipeRightForAntonym
source: Swipe right for antonym quiz
ar: اسحب لليمين لاختبار الضد
hi: विलोम क्विज़ के लिए दाएं स्वाइप करें

source: day
ar: يوم
hi: दिन

source: days
ar: أيام
hi: दिन

source: Exit App
ar: خروج من التطبيق
hi: ऐप से बाहर निकलें

# exitConfirm
source: Are you sure you want to exit Word Master?
ar: هل أنت متأكد أنك تريد الخروج من سيد الكلمات؟
hi: क्या आप वाकई वर्ड मास्टर से बाहर निकलना चाहते हैं?

source: Exit
ar: خروج
hi: बाहर निकलें

source: Word added!
ar: تمت إضافة الكلمة!
hi: शब्द जोड़ा गया!

source: XP earned
ar: نقاط خبرة مكتسبة
hi: अनुभव अर्जित किया

source: LEVEL UP!
ar: ترقية المستوى!
hi: स्तर बढ़ा!

source: Enter word
ar: أدخل كلمة
hi: शब्द दर्ज करें

source: Enter meaning
ar: أدخل المعنى
hi: अर्थ दर्ज करें

# enterSynonyms
source: Enter synonyms (comma separated)
ar: أدخل المرادفات (مفصولة بفواصل)
hi: पर्यायवाची दर्ज करें (अल्पविराम से अलग)

# enterAntonyms
source: Enter antonyms (comma separated)
ar: أدخل الأضداد (مفصولة بفواصل)
hi: विलोम दर्ज करें (अल्पविराम से अलग)

# enterExample
source: Enter example sentence
ar: أدخل جملة مثال
hi: उदाहरण वाक्य दर्ज करें

source: Select source
ar: اختر المصدر
hi: स्रोत चुनें

source: Your Library
ar: مكتبتك
hi: आपकी लाइब्रेरी

source: All
ar: الكل
hi: सभी

# newWords
source: New
ar: جديد
hi: नया

source: Mastered
ar: متقن
hi: महारत हासिल

source: Search words...
ar: ابحث عن كلمات...
hi: शब्द खोजें...

# noWordsToday
source: No words added today
ar: لم تتم إضافة كلمات اليوم
hi: आज कोई शब्द नहीं जोड़े गए

# addFirstWord
source: Add your first word to get started!
ar: أضف كلمتك الأولى للبدء!
hi: शुरू करने के लिए अपना पहला शब्द जोड़ें!

source: Correct!
ar: صحيح!
hi: सही!

source: Incorrect
ar: غير صحيح
hi: गलत

source: The answer is
ar: الإجابة هي
hi: उत्तर है

source: Restore
ar: استعادة
hi: पुनर्स्थापित करें

# restoreConfirm
source: This will replace all current data with the backup. This action cannot be undone.
ar: سيؤدي هذا إلى استبدال جميع البيانات الحالية بالنسخة الاحتياطية. لا يمكن التراجع عن هذا الإجراء.
hi: यह सभी वर्तमान डेटा को बैकअप से बदल देगा। इस क्रिया को पूर्ववत नहीं किया जा सकता।

source: Restore Backup?
ar: استعادة النسخة الاحتياطية؟
hi: बैकअप पुनर्स्थापित करें?

# backupCreated
source: Backup created successfully
ar: تم إنشاء النسخة الاحتياطية بنجاح
hi: बैकअप सफलतापूर्वक बनाया गया

# backupRestored
source: Backup restored successfully
ar: تمت استعادة النسخة الاحتياطية بنجاح
hi: बैकअप सफलतापूर्वक पुनर्स्थापित किया गया

source: Google Drive backup
ar: نسخة احتياطية على Google Drive
hi: Google Drive बैकअप

# dataStoredSecurely
source: Data is stored securely in your Google Drive under "Word Master Backups" folder.
ar: يتم تخزين البيانات بأمان في Google Drive الخاص بك في مجلد "Word Master Backups".
hi: डेटा आपके Google Drive में "Word Master Backups" फ़ोल्डर के तहत सुरक्षित रूप से संग्रहीत किया जाता है।

source: Sign in to Google
ar: تسجيل الدخول إلى Google
hi: Google में साइन इन करें

# signInDescription
source: Sign in with your Google account to enable backup and restore functionality.
ar: قم بتسجيل الدخول باستخدام حساب Google الخاص بك لتمكين وظائف النسخ الاحتياطي والاستعادة.
hi: बैकअप और पुनर्स्थापना कार्यक्षमता को सक्षम करने के लिए अपने Google खाते से साइन इन करें।

source: Sign in with Google
ar: تسجيل الدخول باستخدام Google
hi: Google के साथ साइन इन करें

source: Signed in
ar: تم تسجيل الدخول
hi: साइन इन किया गया

source: Sign Out
ar: تسجيل الخروج
hi: साइन आउट करें

# backupFound
source: Backup found in Google Drive
ar: تم العثور على نسخة احتياطية في Google Drive
hi: Google Drive में बैकअप मिला

source: Create Backup
ar: إنشاء نسخة احتياطية
hi: बैकअप बनाएं

# tryAdjustingSearch
source: Try adjusting your search or filters
ar: حاول تعديل البحث أو المرشحات
hi: अपनी खोज या फ़िल्टर को समायोजित करने का प्रयास करें

# startAddingWords
source: Start adding words to build your library
ar: ابدأ بإضافة الكلمات لبناء مكتبتك
hi: अपनी लाइब्रेरी बनाने के लिए शब्द जोड़ना शुरू करें

source: Add New Word
ar: إضافة كلمة جديدة
hi: नया शब्द जोड़ें

source: Enter the new word
ar: أدخل الكلمة الجديدة
hi: नया शब्द दर्ज करें

source: Please enter a word
ar: الرجاء إدخال كلمة
hi: कृपया एक शब्द दर्ज करें

source: Auto-focus
ar: التركيز التلقائي
hi: स्वचालित फोकस

# wordAddedSuccess
source: Word added!
ar: تمت إضافة الكلمة!
hi: शब्द जोड़ा गया!

source: Failed to add word
ar: فشل في إضافة الكلمة
hi: शब्द जोड़ने में विफल

source: Clear form
ar: مسح النموذج
hi: फॉर्म साफ करें

source: Listen
ar: استمع
hi: सुनें

source: Day streak
ar: سلسلة الأيام
hi: दिन की स्ट्रीक

source: Today
ar: اليوم
hi: आज

source: Review
ar: مراجعة
hi: समीक्षा

source: No words available for quiz
ar: لا توجد كلمات متاحة للاختبار
hi: क्विज़ के लिए कोई शब्द उपलब्ध नहीं

# thisWordHasNoSynonyms
source: This word has no synonyms available
ar: هذه الكلمة ليس لها مرادفات متاحة
hi: इस शब्द के पर्यायवाची उपलब्ध नहीं हैं

# thisWordHasNoAntonyms
source: This word has no antonyms available
ar: هذه الكلمة ليس لها أضداد متاحة
hi: इस शब्द के विलोम उपलब्ध नहीं हैं

# thisWordHasNoMeaning
source: This word has no meaning available
ar: هذه الكلمة ليس لها معنى متاح
hi: इस शब्द का अर्थ उपलब्ध नहीं है

source: Failed to load data
ar: فشل في تحميل البيانات
hi: डेटा लोड करने में विफल

source: Word updated successfully!
ar: تم تحديث الكلمة بنجاح!
hi: शब्द सफलतापूर्वक अपडेट हो गया!

source: Failed to save changes
ar: فشل في حفظ التغييرات
hi: परिवर्तन सहेजने में विफल

source: Delete Word
ar: حذف الكلمة
hi: शब्द हटाएं

# deleteWordConfirm
source: Are you sure you want to delete this word?
ar: هل أنت متأكد أنك تريد حذف هذه الكلمة؟
hi: क्या आप वाकई इस शब्द को हटाना चाहते हैं?

source: Word deleted!
ar: تم حذف الكلمة!
hi: शब्द हटा दिया गया!

source: Failed to delete word
ar: فشل في حذف الكلمة
hi: शब्द हटाने में विफल

source: Edit Word
ar: تعديل الكلمة
hi: शब्द संपादित करें

source: Save Changes
ar: حفظ التغييرات
hi: परिवर्तन सहेजें

source: Source
ar: المصدر
hi: स्रोत

source: Book
ar: كتاب
hi: पुस्तक

source: Article
ar: مقال
hi: लेख

source: Conversation
ar: محادثة
hi: बातचीत

source: Other
ar: أخرى
hi: अन्य

source: Quiz Completed
ar: اكتمل الاختبار
hi: क्विज़ पूर्ण

source: You scored
ar: لقد سجلت
hi: आपने स्कोर किया

source: out of
ar: من أصل
hi: में से

source: Done
ar: تم
hi: हो गया

source: No meaning available
ar: لا يوجد معنى متاح
hi: कोई अर्थ उपलब्ध नहीं

source: You have no added words today
ar: لم تقم بإضافة أي كلمات اليوم
hi: आज आपने कोई शब्द नहीं जोड़े

source: Meanings
ar: المعاني
hi: अर्थ

# meaningsHint
source: An unexpected discovery
ar: اكتشاف غير متوقع
hi: एक अप्रत्याशित खोज

# synonymsHint
source: Fortunate, chance
ar: محظوظ، فرصة
hi: भाग्यशाली, मौका

# antonymsHint
source: Planned, intentional
ar: مخطط، مقصود
hi: योजनाबद्ध, जानबूझकर

# sentenceHint
source: Use this word in your own sentence
ar: استخدم هذه الكلمة في جملتك الخاصة
hi: इस शब्द को अपने वाक्य में उपयोग करें

# sourceHint
source: Where did you learn this word?
ar: أين تعلمت هذه الكلمة؟
hi: आपने यह शब्द कहाँ सीखा?

# addWordSuccess
source: Word added! +{xp} XP earned.
ar: تمت إضافة الكلمة! +{xp} XP مكتسب.
hi: शब्द जोड़ा गया! +{xp} XP अर्जित किया।

# addWordLevelUp
source: Word added! +{xp} XP earned. 🎉 LEVEL UP!
ar: تمت إضافة الكلمة! +{xp} XP مكتسب. 🎉 ترقية المستوى!
hi: शब्द जोड़ा गया! +{xp} XP अर्जित किया। 🎉 स्तर बढ़ा!

source: Synonyms
ar: المرادفات
hi: पर्यायवाची

source: Antonyms
ar: الأضداد
hi: विलोम

# useInSentence
source: Use in a Sentence
ar: استخدم في جملة
hi: वाक्य में उपयोग करें

source: Make it personal
ar: اجعله شخصياً
hi: इसे व्यक्तिगत बनाएं

# whereDidYouLearnThisWord
source: Where did you learn this word? (Source)
ar: أين تعلمت هذه الكلمة؟ (المصدر)
hi: आपने यह शब्द कहाँ सीखा? (स्रोत)

source: Choose source
ar: اختر المصدر
hi: स्रोत चुनें

source: Save Word
ar: حفظ الكلمة
hi: शब्द सहेजें

source: Loading...
ar: جاري التحميل...
hi: लोड हो रहा है...

source: No meaning provided
ar: لم يتم توفير معنى
hi: कोई अर्थ प्रदान नहीं किया गया

source: No synonyms added
ar: لم تتم إضافة مرادفات
hi: कोई पर्यायवाची जोड़े नहीं गए

source: No antonyms added
ar: لم تتم إضافة أضداد
hi: कोई विलोम जोड़े नहीं गए

source: No source specified
ar: لم يتم تحديد مصدر
hi: कोई स्रोत निर्दिष्ट नहीं किया गया

source: Word Statistics
ar: إحصائيات الكلمة
hi: शब्द सांख्यिकी

# xpEarnedStat
source: XP Earned
ar: XP المكتسب
hi: XP अर्जित

# levelStat
source: Level
ar: المستوى
hi: स्तर

source: Completeness
ar: الاكتمال
hi: पूर्णता

source: This field is required
ar: هذا الحقل مطلوب
hi: यह फ़ील्ड आवश्यक है

source: Please enter the meaning
ar: الرجاء إدخال المعنى
hi: कृपया अर्थ दर्ज करें

# whatIsTheMeaningOf
source: What is the meaning of "{word}"?
ar: ما معنى "{word}"؟
hi: "{word}" का अर्थ क्या है?

source: 📖 Meaning Quiz
ar: 📖 اختبار المعنى
hi: 📖 अर्थ क्विज़

source: 🔗 Synonym Quiz
ar: 🔗 اختبار المرادف
hi: 🔗 पर्यायवाची क्विज़

source: ⚡ Antonym Quiz
ar: ⚡ اختبار الضد
hi: ⚡ विलोम क्विज़

# correctAnswer
source: Correct answer: {answer}
ar: الإجابة الصحيحة: {answer}
hi: सही उत्तर: {answer}

# levelUpMessage
source: Level Up! 🎉
ar: ترقية المستوى! 🎉
hi: स्तर बढ़ा! 🎉

source: Enter the word
ar: أدخل الكلمة
hi: शब्द दर्ज करें

source: Enter the meaning
ar: أدخل المعنى
hi: अर्थ दर्ज करें

# enterSynonymsComma
source: Enter synonyms (comma separated)
ar: أدخل المرادفات (مفصولة بفواصل)
hi: पर्यायवाची दर्ज करें (अल्पविराम से अलग)

# enterAntonymsComma
source: Enter antonyms (comma separated)
ar: أدخل الأضداد (مفصولة بفواصل)
hi: विलोम दर्ज करें (अल्पविराम से अलग)

# whereDidYouLearnThisWordShort
source: Where did you learn this word?
ar: أين تعلمت هذه الكلمة؟
hi: आपने यह शब्द कहाँ सीखा?

source: Example Sentence
ar: جملة مثال
hi: उदाहरण वाक्य

source: No example sentence provided
ar: لم يتم توفير جملة مثال
hi: कोई उदाहरण वाक्य प्रदान नहीं किया गया

# editWordTooltip
source: Edit
ar: تعديل
hi: संपादित करें

# cancelTooltip
source: Cancel
ar: إلغاء
hi: रद्द करें

# listenTooltip
source: Listen
ar: استمع
hi: सुनें

# quizTitle
source: Quiz {current}/{total}
ar: اختبار {current}/{total}
hi: क्विज़ {current}/{total}

source: About Word Master
hi: वर्ड मास्टर के बारे में

# version
source: Version 1.0.0
hi: संस्करण 1.0.0

source: About the App
hi: ऐप के बारे में

# aboutTheAppContent
source: Word Master is your ultimate vocabulary companion designed to help you expand your word knowledge effortlessly. Whether you're a student preparing for exams, a professional looking to enhance your communication skills, or simply someone who loves learning new words, Word Master provides the perfect platform to build and maintain your vocabulary.
hi: वर्ड मास्टर आपका अंतिम शब्दावली साथी है जो आपकी शब्द ज्ञान को आसानी से विस्तारित करने में मदद करने के लिए डिज़ाइन किया गया है। चाहे आप परीक्षा की तैयारी करने वाले छात्र हों, अपने संचार कौशल को बढ़ाने की तलाश करने वाले पेशेवर हों, या बस कोई ऐसा व्यक्ति जो नए शब्द सीखना पसंद करता हो, वर्ड मास्टर आपकी शब्दावली बनाने और बनाए रखने के लिए सही मंच प्रदान करता है।

source: Key Features
hi: मुख्य विशेषताएं

# keyFeaturesContent
source: • Add and organize your vocabulary words • Track your learning progress with XP system • Maintain daily learning streaks • Review words with interactive quizzes • Listen to word pronunciations • Categorize words by difficulty levels • Dark and light theme support • Offline functionality with cloud sync
hi: • अपने शब्दावली शब्दों को जोड़ें और व्यवस्थित करें • XP सिस्टम के साथ अपनी सीखने की प्रगति को ट्रैक करें • दैनिक सीखने की स्ट्रीक बनाए रखें • इंटरैक्टिव क्विज़ के साथ शब्दों की समीक्षा करें • शब्द उच्चारण सुनें • कठिनाई स्तरों द्वारा शब्दों को वर्गीकृत करें • डार्क और लाइट थीम सपोर्ट • क्लाउड सिंक के साथ ऑफलाइन कार्यक्षमता

source: Our Mission
hi: हमारा मिशन

# ourMissionContent
source: We believe that a rich vocabulary is the foundation of effective communication. Our mission is to make vocabulary learning engaging, systematic, and rewarding. Through gamification elements like XP points, streaks, and levels, we transform the traditional approach to vocabulary building into an enjoyable journey of discovery.
hi: हम मानते हैं कि एक समृद्ध शब्दावली प्रभावी संचार की नींव है। हमारा मिशन शब्दावली सीखने को आकर्षक, व्यवस्थित और फायदेमंद बनाना है। XP अंक, स्ट्रीक और स्तरों जैसे गेमिफिकेशन तत्वों के माध्यम से, हम शब्दावली निर्माण के पारंपरिक दृष्टिकोण को खोज की एक सुखद यात्रा में बदल देते हैं।

source: Contact Us
hi: हमसे संपर्क करें

# contactUsContent
source: We'd love to hear from you! Whether you have feedback, suggestions, or need support, feel free to reach out to us. Email: support@wordmaster.com Website: www.wordmaster.com Follow us on social media for updates and tips!
hi: हम आपसे सुनना पसंद करेंगे! चाहे आपके पास प्रतिक्रिया, सुझाव हों, या आपको सहायता की आवश्यकता हो, बेझिझक हमसे संपर्क करें। ईमेल: support@wordmaster.com वेबसाइट: www.wordmaster.com अपडेट और टिप्स के लिए सोशल मीडिया पर हमें फॉलो करें!

source: Credits
hi: क्रेडिट

# creditsContent
source: Word Master is developed with ❤️ using Flutter framework. Special thanks to all the developers for making this app possible. Icons by Material Design Icons Fonts by Google Fonts Built with Flutter & Dart
hi: वर्ड मास्टर Flutter फ्रेमवर्क का उपयोग करके ❤️ के साथ विकसित किया गया है। इस ऐप को संभव बनाने वाले सभी डेवलपर्स को विशेष धन्यवाद। Material Design Icons द्वारा आइकन Google Fonts द्वारा फॉन्ट Flutter & Dart के साथ निर्मित

# copyright
source: © 2024 Word Master
hi: © 2024 वर्ड मास्टर

# madeWithLove
source: Made with 💜 for vocabulary enthusiasts
hi: शब्दावली उत्साही लोगों के लिए 💜 के साथ बनाया गया

# backupDescription
source: Backup your vocabulary data to Google Drive and restore it on any device. Your words, progress, streaks, and quiz history will be safely stored in the cloud.
hi: अपने शब्दावली डेटा को Google Drive में बैकअप करें और इसे किसी भी डिवाइस पर पुनर्स्थापित करें। आपके शब्द, प्रगति, स्ट्रीक और क्विज़ इतिहास सुरक्षित रूप से क्लाउड में संग्रहीत किए जाएंगे।
